"You are about to open more then four panes of file info. Maybe you forget to press Control or Option key?" = "Du håller på att öppna mer än 4 flikar av filinfo. Glömde du trycka Kontroll eller Option?";
"Are you sure you want to open?" = "Är det säkert att du vill öppna?";
